{
  "artworks": [
    {
      "id": 1,
      "title": "Nighthawks",
      "artistId": 1,
      "artist": "Georges Seurat",
      "year": 1942,
      "image": "https://www.artic.edu/iiif/2/831a05de-d3f6-f4fa-a460-23008dd58dda/full/843,/0/default.jpg",
      "alt_text": "Scene in a diner, viewed through wrap-around glass windows, at night on an empty urban street. A light-skinned man and woman, he in a suit and she in a red dress, sit together at a triangular wood bar, eyes downcast. At left sits another man, his back to the viewer. Behind the counter is a light-skinned man in a white uniform. The interior lights cast a yellow glow that spills onto the street in pale green. Above the diner a sign reads, \"Phillies\"."
    },
    {
      "id": 2,
      "title": "Sky above Clouds IV",
      "artistId": 2,
      "artist": "Georgia O’Keeffe",
      "year": 1965,
      "image": "https://www.artic.edu/iiif/2/8fa4d1dd-b05f-eb8d-b83f-7b5dd65642db/full/843,/0/default.jpg",
      "alt_text": "A work made of oil on canvas."
    },
    {
      "id": 3,
      "title": "American Gothic",
      "artistId": 3,
      "artist": "Grant Wood",
      "year": 1930,
      "image": "https://www.artic.edu/iiif/2/b272df73-a965-ac37-4172-be4e99483637/full/843,/0/default.jpg",
      "alt_text": "Painting of a woman and an older white man holding a pitchfork, both seen from the waist up. They stand side by side with stern expressions, in front of a white house with a peaked roof."
    },
    {
      "id": 4,
      "title": "The Bedroom",
      "artistId": 4,
      "artist": "Vincent van Gogh",
      "year": 1889,
      "image": "https://www.artic.edu/iiif/2/25c31d8d-21a4-9ea1-1d73-6a2eca4dda7e/full/843,/0/default.jpg",
      "alt_text": "Painting of bedroom, blue walls, green window, tan bed, red bedding."
    },
    {
      "id": 5,
      "title": "A Sunday on La Grande Jatte",
      "artistId": 5,
      "artist": "Edward Hopper",
      "year": 1884,
      "image": "https://www.artic.edu/iiif/2/1adf2696-8489-499b-cad2-821d7fde4b33/full/843,/0/default.jpg",
      "alt_text": "Large painting of people in a crowded park, brushstrokes are dots."
    },
    {
      "id": 6,
      "title": "The Old Guitarist",
      "artistId": 6,
      "artist": "Pablo Picasso",
      "year": 1903,
      "image": "https://www.artic.edu/iiif/2/ddacae05-9279-51b5-e9ab-00024ae01e27/full/843,/0/default.jpg",
      "alt_text": "Painting, mostly in shades of blue, of a thin, bent, older man wearing ragged clothes and sitting cross-legged playing a guitar positioned upright in his lap."
    },
    {
      "id": 7,
      "title": "Self-Portrait",
      "artistId": 4,
      "artist": "Vincent van Gogh",
      "year": 1903,
      "image": "https://www.artic.edu/iiif/2/26d3cea8-44c0-bfbd-a91a-19a007517152/full/843,/0/default.jpg",
      "alt_text": "Painting of a red-haired, bearded man with light skin, painted in short brushstrokes and multicolored dots. The background is likewise a mass of small, closely spaced colored dots, these in green, blue, and red-orange."
    },
    {
      "id": 8,
      "title": "Arrival of the Normandy Train, Gare Saint-Lazare",
      "artistId": 7,
      "artist": "Claude Monet",
      "year": 1877,
      "image": "https://www.artic.edu/iiif/2/0f1cc0e0-e42e-be16-3f71-2022da38cb93/full/843,/0/default.jpg",
      "alt_text": "Loosely painted image of an open-air train station. On the right, a parked train gives off an enormous plumb of white smoke, making the scene look as though it were full of clouds. A huddled mass of barely discernible people crowd around the train on both sides of the tracks. Blue, green, and gray tones dominate."
    },
    {
      "id": 9,
      "title": "Inventions of the Monsters",
      "artistId": 8,
      "artist": "Salvador Dalí",
      "year": 1937,
      "image": "https://www.artic.edu/iiif/2/be9551d4-860f-37a0-1408-086617f1824e/full/843,/0/default.jpg",
      "alt_text": "Painting of stark landscape populated by strange figures, everyday objects, and a burning giraffe."
    },
    {
      "id": 10,
      "title": "The Bay of Marseille, Seen from L’Estaque",
      "artistId": 9,
      "artist": "Paul Cezanne",
      "year": 1885,
      "image": "https://www.artic.edu/iiif/2/d4ca6321-8656-3d3f-a362-2ee297b2b813/full/843,/0/default.jpg",
      "alt_text": "Impressionist sea landscape, tan houses, blue ocean, distant mountains."
    },
    {
      "id": 11,
      "title": "Lozenge Composition with Yellow, Black, Blue, Red, and Gray",
      "artistId": 10,
      "artist": "Piet Mondrian",
      "year": 1921,
      "image": "https://www.artic.edu/iiif/2/25f660ee-f1db-d13b-42a5-56df97c98ba7/full/843,/0/default.jpg",
      "alt_text": "A square white tile, rotated 90 degrees, crossed by black lines intersecting at 90-degree angles. A few of the shapes thus formed—some partial squares, some rectangles—are colored in a single shade of yellow, blue, black, or red."
    },
    {
      "id": 12,
      "title": "Woman before an Aquarium",
      "artistId": 11,
      "artist": "Henri Matisse",
      "year": 1921,
      "image": "https://www.artic.edu/iiif/2/d0e36029-27fc-bf4e-357a-55cfbaf7bdfd/full/843,/0/default.jpg",
      "alt_text": "Painting of woman, arms crossed on brown desk, staring at goldfish."
    }
  ],
  "artists": [
    {
      "id": 1,
      "name": "Georges Seurat",
      "dates": "1859-1891",
      "bio": "Inspired by recently published research in optical and color theory, Georges Seurat distinguished his art from what the Impressionists considered a more intuitive painting approach by developing his own “scientific” style called Pointillism. Tackling the issues of color, light, and form, Seurat’s method juxtaposed tiny dabs of colors to create hues that he believed, through optical blending, were more intense and luminous."
    },
    {
      "id": 2,
      "name": "Georgia O’Keeffe",
      "dates": "1887-1986",
      "bio": "One of the most influential American artists of the 20th century, Georgia O’Keeffe promoted new ideas of abstraction and helped redefine modern art. Best known for her paintings of flowers and plants—enlarged beyond life-size and precisely painted with bold colors—and for her spare and dramatic images inspired by the landscape of the Southwest, O’Keeffe also took inspiration in the aesthetic and architectural styles that she was exposed to during her time as a student at School of the Art Institute of Chicago."
    },
    {
      "id": 3,
      "name": "Grant Wood",
      "dates": "1891-1942",
      "bio": "Grant Wood is known for his stylized and subtly humorous scenes of rural people, Iowa cornfields, and mythic subjects from American history—such as the Art Institute’s iconic painting American Gothic (1930). Along with other Midwestern Regionalist painters like John Steuart Curry and Thomas Hart Benton, Wood advocated for a realistic style and recognizable subjects that showed local places and common people, a radically different approach from European modernism and its push toward abstraction."
    },
    {
      "id": 4,
      "name": "Vincent van Gogh",
      "dates": "1853-1890",
      "bio": "During Vincent van Gogh’s tumultuous career as a painter, he created a revolutionary style characterized by exaggerated forms, a vivid color palette, and loose, spontaneous handling of paint. Although he only actively pursued his art for five years before his death in 1890, his impact has lived on through his works."
    },
    {
      "id": 5,
      "name": "Edward Hopper",
      "dates": "1882-1967",
      "bio": "Edward Hopper was an American realist painter and printmaker. While he is widely known for his oil paintings, he was equally proficient as a watercolorist and printmaker in etching."
    },
    {
      "id": 6,
      "name": "Pablo Picasso",
      "dates": "1881-1973",
      "bio": "The artistic genius of Pablo Picasso has impacted the development of modern and contemporary art with unparalleled magnitude. His prolific output includes over 20,000 paintings, prints, drawings, sculptures, ceramics, theater sets and costumes that convey myriad intellectual, political, social, and amorous messages. His creative styles transcend realism and abstraction, Cubism, Neoclassicism, Surrealism, and Expressionism."
    },
    {
      "id": 7,
      "name": "Claude Monet",
      "dates": "1840-1926",
      "bio": "Claude Monet was a pioneer of the French artistic movement known as Impressionism. Throughout his long career, Monet portrayed the people closest to him and the places he knew best. He favored family and friends as models, often working and exhibiting alongside fellow artists. In the early years he painted the forests of Fountainbleau, Parisian boulevards, suburban villages along the Seine, seaside towns, and flowering fields, and later, after buying a house at Giverny northwest of Paris, stacks of wheat and water lilies. Monet was a proponent of plein air painting, working directly out-of-doors on compositions he would later revise and sometimes complete in his studio. He painted his beloved water lilies in Giverny, where he tended to a water garden and a small pond spanned by a Japanese footbridge. Another favorite subject, meules (stacks of wheat sometimes referred to as “haystacks”), were for Monet a resonant symbol of sustenance and survival—constructed by humans but created by nature."
    },
    {
      "id": 8,
      "name": "Salvador Dalí",
      "dates": "1904-1989",
      "bio": "An author, artist and provocateur, Salvador Dalí was one of the most notable figures of the Surrealist movement. Born in 1904 in Figueras, Catalonia, Dalí studied art in Madrid and Barcelona, where he demonstrated masterful painting skills and experimented with several artistic styles."
    },
    {
      "id": 9,
      "name": "Paul Cezanne",
      "dates": "1839-1906",
      "bio": "One of the most influential artists in the history of modern painting, Paul Cézanne has inspired generations of artists. Generally categorized as a Post-Impressionist, his unique method of building form with color and his analytical approach to nature influenced the art of Cubists, Fauves, and successive generations of avant-garde artists. Beginning to paint in 1860 in his birthplace of Aix-en-Provence and subsequently studying in Paris, Cézanne’s early pictures of romantic and classical themes are imbued with dark colors and executed with an expressive brushwork in the tradition of Eugène Delacroix (1798–1863)."
    },
    {
      "id": 10,
      "name": "Piet Mondrian",
      "dates": "1872-1944",
      "bio": "Piet Mondrian was born Pieter Cornelis Mondriaan, Jr., on March 7, 1872, in Amersfoort, the Netherlands. He studied at the Rijksakademie van Beeldende Kunsten, Amsterdam, from 1892 to 1897. Until 1908, when he began to take annual trips to Domburg in Zeeland, Mondrian’s work was naturalistic—incorporating successive on influences of academic landscape and still-life painting, Dutch Impressionism, and Symbolism."
    },
    {
      "id": 11,
      "name": "Henri Matisse",
      "dates": "1869-1954",
      "bio": "The remarkable career of Henri Matisse, one of the most influential artists of the twentieth century, whose stylistic innovations (along with those of Pablo Picasso) fundamentally altered the course of modern art and affected the art of several generations of younger painters, spanned almost six and a half decades. His vast oeuvre encompassed painting, drawing, sculpture, graphic arts (as diverse as etchings, linocuts, lithographs, and aquatints), paper cutouts, and book illustration. His varied subjects comprised landscape, still life, portraiture, domestic and studio interiors, and particularly focused on the female figure."
    }
  ],
  "comments": [
    {
      "id": 0,
      "body": "hello1"
    },
    {
      "id": 1,
      "body": "placeholder"
    },
    {
      "id": 2,
      "body": "abc"
    },
    {
      "body": "try",
      "id": 3
    },
    {
      "body": "helloooooo",
      "id": 4
    },
    {
      "body": "cool artist",
      "id": 5
    }
  ],
  "favorites": [
    {
      "id": 3,
      "title": "American Gothic",
      "artistId": 3,
      "artist": "Grant Wood",
      "year": 1930,
      "image": "https://www.artic.edu/iiif/2/b272df73-a965-ac37-4172-be4e99483637/full/843,/0/default.jpg",
      "alt_text": "Painting of a woman and an older white man holding a pitchfork, both seen from the waist up. They stand side by side with stern expressions, in front of a white house with a peaked roof.",
      "timestamp": 1670296503641
    }
  ]
}